{
  "architectures": [
    "Qwen3_5MoeForConditionalGeneration"
  ],
  "dtype": "float32",
  "image_token_id": 248056,
  "model_type": "qwen3_5_moe",
  "text_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": null,
    "eos_token_id": 1,
    "head_dim": 32,
    "hidden_act": "silu",
    "hidden_size": 16,
    "initializer_range": 0.02,
    "layer_types": [
      "linear_attention",
      "linear_attention",
      "linear_attention",
      "full_attention"
    ],
    "linear_conv_kernel_dim": 4,
    "linear_key_head_dim": 8,
    "linear_num_key_heads": 2,
    "linear_num_value_heads": 4,
    "linear_value_head_dim": 8,
    "max_position_embeddings": 64,
    "model_type": "qwen3_5_moe_text",
    "moe_intermediate_size": 6,
    "num_attention_heads": 4,
    "num_experts": 8,
    "num_experts_per_tok": 2,
    "num_hidden_layers": 4,
    "num_key_value_heads": 2,
    "output_router_logits": false,
    "pad_token_id": 0,
    "partial_rotary_factor": 0.25,
    "rms_norm_eps": 1e-06,
    "rope_parameters": {
      "mrope_interleaved": true,
      "mrope_section": [
        2,
        1,
        1
      ],
      "partial_rotary_factor": 0.25,
      "rope_theta": 10000000.0,
      "rope_type": "default"
    },
    "router_aux_loss_coef": 0.001,
    "shared_expert_intermediate_size": 12,
    "tie_word_embeddings": true,
    "use_cache": true,
    "vocab_size": 64
  },
  "tie_word_embeddings": true,
  "transformers_version": "5.11.0",
  "video_token_id": 248057,
  "vision_config": {
    "depth": 1,
    "hidden_act": "gelu_pytorch_tanh",
    "hidden_size": 16,
    "in_channels": 3,
    "initializer_range": 0.02,
    "intermediate_size": 16,
    "model_type": "qwen3_5_moe_vision",
    "num_heads": 2,
    "num_position_embeddings": 4,
    "out_hidden_size": 16,
    "patch_size": 4,
    "spatial_merge_size": 1,
    "temporal_patch_size": 1
  },
  "vision_end_token_id": 248054,
  "vision_start_token_id": 248053
}
