{
  "metadata": {
    "total_parameters": 26032,
    "total_size": 104128
  },
  "weight_map": {
    "model.language_model.embed_tokens.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.0.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.0.linear_attn.A_log": "model-00001-of-00002.safetensors",
    "model.language_model.layers.0.linear_attn.conv1d.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.0.linear_attn.dt_bias": "model-00001-of-00002.safetensors",
    "model.language_model.layers.0.linear_attn.in_proj_a.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.0.linear_attn.in_proj_b.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.0.linear_attn.in_proj_qkv.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.0.linear_attn.in_proj_z.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.0.linear_attn.norm.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.0.linear_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.0.mlp.down_proj.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.0.mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.0.mlp.up_proj.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.0.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.1.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.1.linear_attn.A_log": "model-00001-of-00002.safetensors",
    "model.language_model.layers.1.linear_attn.conv1d.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.1.linear_attn.dt_bias": "model-00001-of-00002.safetensors",
    "model.language_model.layers.1.linear_attn.in_proj_a.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.1.linear_attn.in_proj_b.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.1.linear_attn.in_proj_qkv.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.1.linear_attn.in_proj_z.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.1.linear_attn.norm.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.1.linear_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.1.mlp.down_proj.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.1.mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.1.mlp.up_proj.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.1.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.2.input_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.2.linear_attn.A_log": "model-00001-of-00002.safetensors",
    "model.language_model.layers.2.linear_attn.conv1d.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.2.linear_attn.dt_bias": "model-00001-of-00002.safetensors",
    "model.language_model.layers.2.linear_attn.in_proj_a.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.2.linear_attn.in_proj_b.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.2.linear_attn.in_proj_qkv.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.2.linear_attn.in_proj_z.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.2.linear_attn.norm.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.2.linear_attn.out_proj.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.2.mlp.down_proj.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.2.mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.2.mlp.up_proj.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.2.post_attention_layernorm.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.3.input_layernorm.weight": "model-00002-of-00002.safetensors",
    "model.language_model.layers.3.mlp.down_proj.weight": "model-00002-of-00002.safetensors",
    "model.language_model.layers.3.mlp.gate_proj.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.3.mlp.up_proj.weight": "model-00002-of-00002.safetensors",
    "model.language_model.layers.3.post_attention_layernorm.weight": "model-00002-of-00002.safetensors",
    "model.language_model.layers.3.self_attn.k_norm.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.3.self_attn.k_proj.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.3.self_attn.o_proj.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.3.self_attn.q_norm.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.3.self_attn.q_proj.weight": "model-00001-of-00002.safetensors",
    "model.language_model.layers.3.self_attn.v_proj.weight": "model-00001-of-00002.safetensors",
    "model.language_model.norm.weight": "model-00002-of-00002.safetensors",
    "model.visual.blocks.0.attn.proj.bias": "model-00001-of-00002.safetensors",
    "model.visual.blocks.0.attn.proj.weight": "model-00001-of-00002.safetensors",
    "model.visual.blocks.0.attn.qkv.bias": "model-00001-of-00002.safetensors",
    "model.visual.blocks.0.attn.qkv.weight": "model-00001-of-00002.safetensors",
    "model.visual.blocks.0.mlp.linear_fc1.bias": "model-00001-of-00002.safetensors",
    "model.visual.blocks.0.mlp.linear_fc1.weight": "model-00001-of-00002.safetensors",
    "model.visual.blocks.0.mlp.linear_fc2.bias": "model-00001-of-00002.safetensors",
    "model.visual.blocks.0.mlp.linear_fc2.weight": "model-00001-of-00002.safetensors",
    "model.visual.blocks.0.norm1.bias": "model-00001-of-00002.safetensors",
    "model.visual.blocks.0.norm1.weight": "model-00001-of-00002.safetensors",
    "model.visual.blocks.0.norm2.bias": "model-00001-of-00002.safetensors",
    "model.visual.blocks.0.norm2.weight": "model-00001-of-00002.safetensors",
    "model.visual.merger.linear_fc1.bias": "model-00001-of-00002.safetensors",
    "model.visual.merger.linear_fc1.weight": "model-00001-of-00002.safetensors",
    "model.visual.merger.linear_fc2.bias": "model-00001-of-00002.safetensors",
    "model.visual.merger.linear_fc2.weight": "model-00001-of-00002.safetensors",
    "model.visual.merger.norm.bias": "model-00001-of-00002.safetensors",
    "model.visual.merger.norm.weight": "model-00001-of-00002.safetensors",
    "model.visual.patch_embed.proj.bias": "model-00001-of-00002.safetensors",
    "model.visual.patch_embed.proj.weight": "model-00001-of-00002.safetensors",
    "model.visual.pos_embed.weight": "model-00001-of-00002.safetensors"
  }
}
