{
  "model_type": "gemma4",
  "text_config": {
    "_name_or_path": "",
    "architectures": null,
    "attention_bias": false,
    "attention_dropout": 0.0,
    "attention_k_eq_v": true,
    "bos_token_id": 2,
    "chunk_size_feed_forward": 0,
    "dtype": null,
    "enable_moe_block": false,
    "eos_token_id": 1,
    "expert_intermediate_size": null,
    "final_logit_softcapping": 30.0,
    "global_head_dim": 8,
    "head_dim": 4,
    "hidden_activation": "gelu_pytorch_tanh",
    "hidden_size": 8,
    "hidden_size_per_layer_input": 0,
    "id2label": {
      "0": "LABEL_0",
      "1": "LABEL_1"
    },
    "initializer_range": 0.02,
    "intermediate_size": 16,
    "is_encoder_decoder": false,
    "label2id": {
      "LABEL_0": 0,
      "LABEL_1": 1
    },
    "layer_types": [
      "sliding_attention",
      "full_attention"
    ],
    "max_position_embeddings": 32,
    "model_type": "gemma4_text",
    "moe_intermediate_size": null,
    "num_attention_heads": 2,
    "num_experts": null,
    "num_global_key_value_heads": 1,
    "num_hidden_layers": 2,
    "num_key_value_heads": 1,
    "num_kv_shared_layers": 0,
    "output_attentions": false,
    "output_hidden_states": false,
    "pad_token_id": 0,
    "problem_type": null,
    "return_dict": true,
    "rms_norm_eps": 1e-06,
    "rope_parameters": {
      "full_attention": {
        "partial_rotary_factor": 0.5,
        "rope_theta": 1000000.0,
        "rope_type": "proportional"
      },
      "sliding_attention": {
        "rope_theta": 10000.0,
        "rope_type": "default"
      }
    },
    "sliding_window": 3,
    "tie_word_embeddings": true,
    "top_k_experts": null,
    "transformers_version": "5.11.0",
    "use_bidirectional_attention": "vision",
    "use_cache": true,
    "use_double_wide_mlp": false,
    "vocab_size": 16,
    "vocab_size_per_layer_input": 16
  },
  "tie_word_embeddings": true
}
